import matplotlib.pyplot as plt

x1 = [1.81, 5.98, 11, 35, 70] 
y1 = [3.62, 3.59, 3.57, 3.53, 3.51] 

x2 = [5.94, 19, 33, 87, 139]
y2 = [11.89, 11.3, 10.69, 8.65, 6.93]
 
x3 = [3.62, 12, 22, 71, 140]        
y3 = [7.23, 7.17, 7.14, 7.07, 7.01] 

x4 = [6.02, 20, 36, 104, 187]            
y4 = [12.04, 11.74, 11.43, 10.35, 9.35]  

# Создаем фигуру и оси
plt.figure(figsize=(15, 10))  # Размер графика (ширина, высота)

# Строим первый график
plt.plot(x1, y1, label='Однополупериодный без фильтра', color='blue', marker='o', linestyle='-', linewidth=2)

# Строим второй график
plt.plot(x2, y2, label='Однополупериодный С СLC фильтром', color='red', marker='s', linestyle='--', linewidth=2)

# Строим третий график
plt.plot(x3, y3, label='Двухполупериодный без фильтра', color='green', marker='^', linestyle='-.', linewidth=2)

# Строим четвертый график
plt.plot(x4, y4, label='Двухполупериодный С СLC фильтром', color='purple', marker='d', linestyle=':', linewidth=2)

# Подписываем оси
plt.xlabel('Напряжение, U, В')  # Подпись оси X
plt.ylabel('Сила тока, I, мА')  # Подпись оси Y

# Добавляем заголовок графика
plt.title('ВАХ')  # Заголовок графика

# Включаем сетку
plt.grid(True, linestyle='--', alpha=0.7)  # Включаем сетку с пунктирной линией

# Добавляем легенду
plt.legend(loc='upper right')  # Легенда графика (loc указывает расположение)

# Отображаем график
plt.show()